cf/Documents/ClosePeriod.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ClosePeriod</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Bookkeeping</xr:Item>
				<xr:Item>InformationRegister.DocumentHierarchy</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Author</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.DocumentAuthor</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Company</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FinancialYear</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.FinancialYears</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PartialJournal</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PeriodEndClosingAccount</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Bookkeeping</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PeriodEndClosingExtDimension1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.BookkeepingExtDimensions</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PeriodEndClosingExtDimension2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.BookkeepingExtDimensions</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PeriodEndClosingExtDimension3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.BookkeepingExtDimensions</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PostingDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RetainedEarningsAccount</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Bookkeeping</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RetainedEarningsExtDimension1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.BookkeepingExtDimensions</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RetainedEarningsExtDimension2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.BookkeepingExtDimensions</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RetainedEarningsExtDimension3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.BookkeepingExtDimensions</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ClosePeriodRecords</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Account</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Bookkeeping</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>AmountCr</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.NonNegativeAmount</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>AmountDr</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.NonNegativeAmount</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ExtDimension1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.BookkeepingExtDimensions</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ExtDimension2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.BookkeepingExtDimensions</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ExtDimension3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.BookkeepingExtDimensions</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Currency</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Currency</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>CurrencyAmount</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Amount</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/AccountingRegisters/Bookkeeping.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccountingRegister>
		<Properties>
			<Name>Bookkeeping</Name>
			<ChartOfAccounts>ChartOfAccounts.Bookkeeping</ChartOfAccounts>
			<Correspondence>false</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Company</v8:TypeSet>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Currency</v8:TypeSet>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Bookkeeping.AccountingFlag.Currency</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Amount</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Amount</v8:TypeSet>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Bookkeeping.ExtDimensionAccountingFlag.Amount</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CurrencyAmount</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Amount</v8:TypeSet>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Bookkeeping.AccountingFlag.Currency</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Bookkeeping.ExtDimensionAccountingFlag.Currency</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Quantity</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Quantity</v8:TypeSet>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Bookkeeping.AccountingFlag.Quantity</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Bookkeeping.ExtDimensionAccountingFlag.Quantity</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Description</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AmountDr</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Amount</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AmountCr</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Amount</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PartialJournal</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

cf/Enums/AlertType.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>AlertType</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Warning</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Error</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Enums/AlertsAttributesPropertyType.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>AlertsAttributesPropertyType</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>_Condition</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Attribute</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Property</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>UniqueAttributes</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Catalogs/FinancialYears.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>FinancialYears</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>DateFrom</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DateTo</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Closed</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/Documents/ClosePeriod/Ext/ObjectModule.bsl
Procedure Filling(Base)
	
	If Base = Undefined Then 	
		CommonAtServer.FillDocumentHeader(ThisObject);
	EndIf;
	
EndProcedure

Procedure FillCheckProcessing(Cancel, CheckedAttributes)
	CheckedAttributes.Clear();
EndProcedure

Procedure BeforeWrite(Cancel, WriteMode, PostingMode)
	
	// WARNING!!! Calling of this function should be on begin of BeforeWrite function
	// Please, don't remove this call - it may cause damage in logic of configuration
	Common.GetObjectModificationFlag(ThisObject);
	
EndProcedure

Procedure Posting(Cancel, PostingMode)
	
	DocumentsPostingAndNumbering.CheckPostingPermission(ThisObject, Cancel, AdditionalProperties.MessageTitle);	
	If Cancel Then
		Return;
	EndIf;
	
	// Check documents attributes filling
		
	AllAttributesValueTable = Alerts.AlertsExpandAttributesValueTable(Alerts.AlertReturnPredefinedAttributesValueTableByObject(ThisObject),GetAttributesValueTableForValidation(PostingMode));
	AllTabularPartsAttributesStructure = GetAttributesStructureForTabularPartsValidation(PostingMode);
	
	Alerts.AlertDoCommonCheck(ThisObject,AllAttributesValueTable,AllTabularPartsAttributesStructure,Cancel);
	
	If Cancel Then
		Return;
	EndIf;
	
	PostingAtServer.ClearRegisterRecordsForObject(ThisObject);
	
	If BegOfDay(PostingDate)<BegOfDay(FinancialYear.DateFrom) OR EndOfDay(PostingDate)>EndOfDay(FinancialYear.DateTo) Then
		Alerts.AddAlert( NStr("en = ""Posting date is not valid with financial year""; pl = ""Data ksiegowania dokumentu nie mieści się w zakresie wybranego roku finansowego"""), Enums.AlertType.Error, Cancel, ThisObject);	
	EndIf;
	
	NextFinancialYear = BookkeepingCommon.GetFinancialYear(EndOfDay(PostingDate)+1);
	
	If NextFinancialYear=Catalogs.FinancialYears.EmptyRef() Then
		Alerts.AddAlert( NStr("en = ""The next financial year is not created.""; pl = ""Brak kolejnego roku finansowego dla przeksięgowania wyniku finansowego na rozliczenie wyniku finansowego"""), Enums.AlertType.Error, Cancel, ThisObject);	
	EndIf;

	If NextFinancialYear=FinancialYear Then
		Alerts.AddAlert( NStr("en = ""Posting open perid and close period in same financial year is blocked.""; pl = ""Nie można przeksięgować wyniku finansowego na rozliczenie wyniku finansowego w tym samym okresie co przeksięgowanie kont wynikowych na wynik finansowy"""), Enums.AlertType.Error, Cancel, ThisObject);	
		
	EndIf;

	If Cancel Then
		Return;
	EndIf;
	
	RegisterRecords.Bookkeeping.SetProgramBookkeepingPostingClosePeriodFlag();

	MessageTextBegin = "";
	
	ClosePeriodRecordsTotalAmountDr = ClosePeriodRecords.Total("AmountDr");
	ClosePeriodRecordsTotalAmountCr = ClosePeriodRecords.Total("AmountCr");
	TmpClosePeriodRecords = ClosePeriodRecords.Unload();
	TmpClosePeriodRecords.Columns.Add("Period");

	ClosingPeriod = Date(Year(PostingDate), Month(PostingDate), Day(PostingDate), 23, 59, 50);
	OpeningPeriod = Date(Year(EndOfDay(PostingDate)+1), Month(EndOfDay(PostingDate)+1), Day(EndOfDay(PostingDate)+1), 00, 00, 00);
	
	For Each TmpClosePeriodRecordsItem In TmpClosePeriodRecords Do
		TmpClosePeriodRecordsItem.Period = ClosingPeriod;
	EndDo;	
	
	NationalCurrency = Constants.NationalCurrency.Get();
	
	If ClosePeriodRecordsTotalAmountDr<>ClosePeriodRecordsTotalAmountCr Then
		
		ClosePeriodCompnesationRow = TmpClosePeriodRecords.Add();
		ClosePeriodCompnesationRow.Account = PeriodEndClosingAccount;
		ClosePeriodCompnesationRow.ExtDimension1 = PeriodEndClosingExtDimension1;
		ClosePeriodCompnesationRow.ExtDimension2 = PeriodEndClosingExtDimension2;
		ClosePeriodCompnesationRow.ExtDimension3 = PeriodEndClosingExtDimension3;
		If ClosePeriodRecordsTotalAmountDr>ClosePeriodRecordsTotalAmountCr Then
			ClosePeriodCompnesationRow.AmountCr = ClosePeriodRecordsTotalAmountDr - ClosePeriodRecordsTotalAmountCr;
		Else
			ClosePeriodCompnesationRow.AmountDr = ClosePeriodRecordsTotalAmountCr - ClosePeriodRecordsTotalAmountDr;
		EndIf;
		
		If ClosePeriodCompnesationRow.Account.Currency Then
			ClosePeriodCompnesationRow.Currency = NationalCurrency;
			ClosePeriodCompnesationRow.CurrencyAmount = ?(ClosePeriodCompnesationRow.AmountDr <> 0, ClosePeriodCompnesationRow.AmountDr, ClosePeriodCompnesationRow.AmountCr);
		EndIf;	
	
		ClosePeriodCompnesationRow.Period = ClosingPeriod;
		
		PeriodEndClosingAccountOpeningRow = TmpClosePeriodRecords.Add();
		FillPropertyValues(PeriodEndClosingAccountOpeningRow,ClosePeriodCompnesationRow);
		PeriodEndClosingAccountOpeningRow.AmountDr = ClosePeriodCompnesationRow.AmountCr;
		PeriodEndClosingAccountOpeningRow.AmountCr = ClosePeriodCompnesationRow.AmountDr;
		PeriodEndClosingAccountOpeningRow.Period = OpeningPeriod;
		
		RetainedEarningsAccountOpeningRow = TmpClosePeriodRecords.Add();
		RetainedEarningsAccountOpeningRow.Account = RetainedEarningsAccount;
		RetainedEarningsAccountOpeningRow.ExtDimension1 = RetainedEarningsExtDimension1;
		RetainedEarningsAccountOpeningRow.ExtDimension2 = RetainedEarningsExtDimension2;
		RetainedEarningsAccountOpeningRow.ExtDimension3 = RetainedEarningsExtDimension3;
		RetainedEarningsAccountOpeningRow.AmountCr = ClosePeriodCompnesationRow.AmountCr;
		RetainedEarningsAccountOpeningRow.AmountDr = ClosePeriodCompnesationRow.AmountDr;
		If RetainedEarningsAccountOpeningRow.Account.Currency Then
			RetainedEarningsAccountOpeningRow.Currency = NationalCurrency;
			RetainedEarningsAccountOpeningRow.CurrencyAmount = ?(RetainedEarningsAccountOpeningRow.AmountDr <> 0, RetainedEarningsAccountOpeningRow.AmountDr, RetainedEarningsAccountOpeningRow.AmountCr);
		EndIf;	
		RetainedEarningsAccountOpeningRow.Period = OpeningPeriod;
	EndIf;	
	For Each Selection In TmpClosePeriodRecords Do		
		
		MessageTextBegin = NStr("en=""Tabular part 'Close period records', line number "";pl=""Część tabelaryczna 'Zamknięcie okresu', numer linii """) + TrimAll(Selection.LineNumber) + ". ";
	
		If Selection.AmountDr <> 0 And Selection.AmountCr <> 0 Then
			Alerts.AddAlert(MessageTextBegin + NStr("en='Please, input only one Amount: Debit or Credit!';pl='Wprowadź tylko jedną kwotę: po stronie Winien lub Ma!'"), Enums.AlertType.Error, Cancel,ThisObject);
		EndIf;
		
		Record = RegisterRecords.Bookkeeping.Add();
		RegisterRecords.Bookkeeping.Write = True;
		RegisterRecords.Bookkeeping.LockForUpdate = True;
		
		If Selection.AmountDr <> 0 Then
			Record.RecordType = AccountingRecordType.Debit;
		Else
			Record.RecordType = AccountingRecordType.Credit;
		EndIf;
		
		Record.Period         = Selection.Period;
		Record.Company        = Company;
		Record.PartialJournal = PartialJournal;
		Record.Account        = Selection.Account;
		
		Record.Currency = Selection.Currency;
		Record.CurrencyAmount = Selection.CurrencyAmount;
		Record.Amount         = ?(Selection.AmountDr <> 0, Selection.AmountDr, Selection.AmountCr);
		Record.Description = NStr("en = 'Close financial year'; pl = 'Zamknięcie roku finansowego'") + " " + FinancialYear;
		
		Accounting.SetExtDimension(Record.Account, Record.ExtDimensions, 1, Selection.ExtDimension1, , MessageTextBegin, AdditionalProperties.MessageTitle);
		Accounting.SetExtDimension(Record.Account, Record.ExtDimensions, 2, Selection.ExtDimension2, , MessageTextBegin, AdditionalProperties.MessageTitle);
		Accounting.SetExtDimension(Record.Account, Record.ExtDimensions, 3, Selection.ExtDimension3, , MessageTextBegin, AdditionalProperties.MessageTitle);
		
	EndDo;
		
EndProcedure

Procedure UndoPosting(Cancel)
	
	DocumentsPostingAndNumbering.CheckUndoPostingPermission(ThisObject, Cancel, AdditionalProperties.MessageTitle);
	If Cancel Then
		Return;
	EndIf;
	
EndProcedure

////////////////////////////////////////////////////////////////////////////////
// OTHER PROCEDURES


Function GetAttributesValueTableForValidation(PostingMode) Export
	
	AttributesStructure = New Structure("Company,FinancialYear,PostingDate, PeriodEndClosingAccount, RetainedEarningsAccount");
	AttributesValueTable = Alerts.AlertCreateAttributesValueTableFromStructure(AttributesStructure,Enums.AlertType.Error);
	Return AttributesValueTable;

	
EndFunction	

Function GetAttributesStructureForTabularPartsValidation(PostingMode) Export
	
	TabularPartsStructure = New Structure();
	
	AttributesStructure = New Structure("");
	
	ItemsLinesValueTable = Alerts.AlertCreateAttributesValueTableFromStructure(AttributesStructure,Enums.AlertType.Error);
	ItemsLinesValueTable = Alerts.AddAttributesValueTableRow(ItemsLinesValueTable,"CheckNotEmpty",,Enums.AlertsAttributesPropertyType.Property,Enums.AlertType.Error);

	TabularPartsStructure.Insert("ClosePeriodRecords",ItemsLinesValueTable);
	
	
	Return TabularPartsStructure;
	
EndFunction	


Function DocumentChecks(AlertsTable, Cancel = Undefined) Export 
	
	Return AlertsTable;
	
EndFunction

Function DocumentChecksTabularPart(AlertsTable, Cancel = Undefined) Export 
	
	Return AlertsTable;
	
EndFunction
